umartechboy/MarlinD6500/Marlin/src/HAL/ESP32/HAL.cpp
/**
 * Marlin 3D Printer Firmware
 * Copyright (c) 2020 MarlinFirmware [https://github.com/MarlinFirmware/Marlin]
 *
 * Based on Sprinter and grbl.
 * Copyright (c) 2011 Camiel Gubbels / Erik van der Zalm
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 */
#ifdef ARDUINO_ARCH_ESP32

#include "../../inc/MarlinConfig.h"
#include "Music.h"
#include <rom/rtc.h>
#include <driver/adc.h>
#include <esp_adc_cal.h>
#include <HardwareSerial.h>
#include <soc/adc_channel.h>
#include <ESP32_SoftWire.h>
#include "SoftWireLibs/PCF8574/PCF8574.h"
#include "LoadCell/LoadCell.h"
#include "M3DUI/App/MenuApp.h"
#include "..\..\feature\powerloss.h"
//#include "SoftWireLibs/ADS1x15/Adafruit_ADS1X15.h"
#include <map>
#include "LoadCell/LoadCell.h"
std::map<int, uint16_t> adcMap;
SoftWire sWire;
PCF8574 pcf1(0x20, &sWire);
PCF8574 pcf2(0x21, &sWire); // Closer to ESP32 (U6)
SemaphoreHandle_t xPCFIOMutex;
TaskHandle_t pcfTaskHandle = NULL;
volatile uint16_t pcfReadCache = 0xFFFF;
volatile bool pcf1_write_pending = false;
volatile bool pcf2_write_pending = false;
volatile bool pcf1_read_pending = false;
volatile bool pcf2_read_pending = false;
volatile uint16_t pcfMapToSync = 0xFFFF;
volatile uint16_t pcfWriteMapConfirmed = 0xFFFF;

//Adafruit_ADS1115 ads;  /* Use this for the 16-bit version */
#if ENABLED(USE_ESP32_TASK_WDT)
  #include <esp_task_wdt.h>
#endif

#if ENABLED(WIFISUPPORT)
  #include <ESPAsyncWebServer.h>
  #include "wifi.h"
  #if ENABLED(OTASUPPORT)
    #include "ota.h"
  #endif
  #if ENABLED(WEBSUPPORT)
    #include "spiffs.h"
    #include "web.h"
  #endif
#endif

#if ENABLED(ESP3D_WIFISUPPORT)
  DefaultSerial1 MSerial0(false, Serial2Socket);
#endif

// ------------------------
// Externs
// ------------------------

portMUX_TYPE MarlinHAL::spinlock = portMUX_INITIALIZER_UNLOCKED;

// ------------------------
// Local defines
// ------------------------

#define V_REF 1100

// ------------------------
// Public Variables
// ------------------------

uint16_t MarlinHAL::adc_result;
pwm_pin_t MarlinHAL::pwm_pin_data[MAX_EXPANDER_BITS];

// ------------------------
// Private Variables
// ------------------------

esp_adc_cal_characteristics_t characteristics[ADC_ATTEN_MAX];
adc_atten_t attenuations[ADC1_CHANNEL_MAX] = {};
uint32_t thresholds[ADC_ATTEN_MAX];

volatile int numPWMUsed = 0;
volatile struct { pin_t pin; int value; } pwmState[MAX_PWM_PINS];

pin_t chan_pin[CHANNEL_MAX_NUM + 1] = { 0 }; // PWM capable IOpins - not 0 or >33 on ESP32

struct {
  uint32_t freq; // ledcReadFreq doesn't work if a duty hasn't been set yet!
  uint16_t res;
} pwmInfo[(CHANNEL_MAX_NUM + 1) / 2];

// ------------------------
// Public functions
// ------------------------

#if ENABLED(WIFI_CUSTOM_COMMAND)

  bool wifi_custom_command(char * const command_ptr) {
    #if ENABLED(ESP3D_WIFISUPPORT)
      return esp3dlib.parse(command_ptr);
    #else
      UNUSED(command_ptr);
      return false;
    #endif
  }

#endif

#if ENABLED(USE_ESP32_EXIO)

  HardwareSerial YSerial2(2);

  void Write_EXIO(uint8_t IO, uint8_t v) {
    if (hal.isr_state()) {
      hal.isr_off();
      YSerial2.write(0x80 | (((char)v) << 5) | (IO - 100));
      hal.isr_on();
    }
    else
      YSerial2.write(0x80 | (((char)v) << 5) | (IO - 100));
  }

#endif

#if ENABLED(M3DPrintVueSupport)
  extern void M3DPrintVueSetup();
  extern void M3DPrintVueLoop();
#endif
bool pcfIsSyncing = false;
bool PCFIsBusy = false;
uint16_t lockedBits = 0;
bool PCFSync(bool force = false);
bool LockPCF(uint16_t lockedPins){
  if (pcfIsSyncing)
  // Can't get a lock because the PCF are already busy.
    return false;
    
  lockedBits = lockedPins;
  PCFIsBusy = true;
  return true;
}
void ReleasePCF(){
  PCFIsBusy = false;
  lockedBits = 0;
  PCFSync();
}
bool PCFSync(bool force){
  if (PCFIsBusy && !force)
    return false;
  if (pcfIsSyncing)
    return false;
  pcfIsSyncing = true;
  if (pcf1_write_pending) {
    pcf1.write8(pcfMapToSync & 0xFF);
    pcf1_write_pending = false;
  }

  if (pcf2_write_pending) {
    pcf2.write8((pcfMapToSync >> 8) & 0xFF);
    pcf2_write_pending = false;
  }

  pcfWriteMapConfirmed = pcfMapToSync;

  if (pcf1_read_pending) {
    pcfReadCache &= 0xFF00;
    pcfReadCache |= pcf1.read8();
    pcf1_read_pending = false;
  }

  if (pcf2_read_pending) {
    pcfReadCache &= 0x00FF;
    pcfReadCache |= pcf2.read8() << 8;
    pcf2_read_pending = false;
  }
  pcfIsSyncing = false;
  return true;
}
void pcfServiceTask(void *param) {
  for (;;) {
    // Block until notified
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);  // clears notification automatically
    if (xSemaphoreTake(xPCFIOMutex, portMAX_DELAY)) {
      PCFSync();
      xSemaphoreGive(xPCFIOMutex);
    }
  }
}


void InitIOExpanders(){
  xPCFIOMutex = xSemaphoreCreateMutex();
  xTaskCreatePinnedToCore(pcfServiceTask, "PCFService", 2048, NULL, 1, &pcfTaskHandle, 1);
  //SERIAL_IMPL.println("Starting Wire and IO Expander");
  sWire.begin(21, 22, 400000);
  if (pcf1.begin()){
    //SERIAL_IMPL.println("PCF1 Started");
  }
  else  
    //SERIAL_IMPL.println("PCF1 Failed");
    
  if (pcf2.begin()){
    //SERIAL_IMPL.println("PCF2 Started");
  }
  else  
    //SERIAL_IMPL.println("PCF2 Failed");
    
  // if (ads.begin(0x48, &sWire)){
  //   SERIAL_IMPL.println("ADS1115 Started");
  // }
  // else  
  //   SERIAL_IMPL.println("ADS1115 Failed");

  //SERIAL_IMPL.println("Expanders On.");
  delay(20);
  #define pcfBitOne(pin) (1 << (pin - 200))
  pcfMapToSync = 0 | 
    pcfBitOne(X_ENABLE_PIN) |
    pcfBitOne(Y_ENABLE_PIN) |
    pcfBitOne(E0_ENABLE_PIN) |
    pcfBitOne(E1_ENABLE_PIN) |
    pcfBitOne(X_STOP_PIN) |
    pcfBitOne(Z_STOP_PIN) |
    pcfBitOne(HxData);
  pcf1.write8(pcfMapToSync); // 200-207
  pcf2.write8(pcfMapToSync >> 8); // 208-215, 1 for X and Z stops
}

void MarlinHAL::init_board() {
  UISetup();
  LoadCellSetup();
  InitMusic(Y_STEP_PIN, Y_DIR_PIN, Y_ENABLE_PIN);

