umartechboy/MarlinD6500/Marlin/src/HAL/ESP32/HAL.cpp
  SERIAL_IMPL.println("Starting SD to look for PLR");
  if(!card.isMounted()){
    card.mount();
  }

  // if (recovery.exists()){
  //   SERIAL_IMPL.println("Loading recovery");
  //   recovery.load();
  //   if (recovery.valid()){
  //     SERIAL_IMPL.println("Valid Recovery loaded");
  //     mainScreenStep.printStatus = PrintStatus::PrintToRecover;      
  //     SERIAL_IMPL.printf("File Name: %s\n", recovery.info.sd_filename);
  //     SERIAL_IMPL.printf("SD Pos: %d\n", recovery.info.sdpos);
  //     SERIAL_IMPL.printf("X offset: %f\n", recovery.info.home_offset.x);
  //     SERIAL_IMPL.printf("Y offset: %f\n", recovery.info.home_offset.y);
  //     SERIAL_IMPL.printf("Z offset: %f\n", recovery.info.home_offset.z);
  //     SERIAL_IMPL.printf("X shift: %f\n", recovery.info.position_shift.x);
  //     SERIAL_IMPL.printf("Y shift: %f\n", recovery.info.position_shift.y);
  //     SERIAL_IMPL.printf("Z shift: %f\n", recovery.info.position_shift.z);
  //     SERIAL_IMPL.printf("Active Extrder: %d\n", recovery.info.active_extruder);
  //     SERIAL_IMPL.printf("Elapsed: %d\n", recovery.info.print_job_elapsed);
  //   }
  //   else {
  //     SERIAL_IMPL.println("Recovery not valid");
  //   }
  // }
  // else {
  //   SERIAL_IMPL.println("No Recovery Data");
  // }
  
  #if ENABLED(USE_ESP32_TASK_WDT)
    esp_task_wdt_init(10, true);
  #endif
  #if ENABLED(M3DPrintVueSupport)
    M3DPrintVueSetup();
  #endif
  #if ENABLED(ESP3D_WIFISUPPORT)
    esp3dlib.init();
  #elif ENABLED(WIFISUPPORT)
    wifi_init();
    TERN_(OTASUPPORT, OTA_init());
    #if ENABLED(WEBSUPPORT)
      spiffs_init();
      web_init();
    #endif
    server.begin();
  #endif

  // ESP32 uses a GPIO matrix that allows pins to be assigned to hardware serial ports.
  // The following code initializes hardware Serial1 and Serial2 to use user-defined pins
  // if they have been defined.
  #if defined(HARDWARE_SERIAL1_RX) && defined(HARDWARE_SERIAL1_TX)
    HardwareSerial Serial1(1);
    #ifdef TMC_BAUD_RATE  // use TMC_BAUD_RATE for Serial1 if defined
      Serial1.begin(TMC_BAUD_RATE, SERIAL_8N1, HARDWARE_SERIAL1_RX, HARDWARE_SERIAL1_TX);
    #else  // use default BAUDRATE if TMC_BAUD_RATE not defined
      Serial1.begin(BAUDRATE, SERIAL_8N1, HARDWARE_SERIAL1_RX, HARDWARE_SERIAL1_TX);
    #endif
  #endif
  #if defined(HARDWARE_SERIAL2_RX) && defined(HARDWARE_SERIAL2_TX)
    HardwareSerial Serial2(2);
    #ifdef TMC_BAUD_RATE  // use TMC_BAUD_RATE for Serial1 if defined
      Serial2.begin(TMC_BAUD_RATE, SERIAL_8N1, HARDWARE_SERIAL2_RX, HARDWARE_SERIAL2_TX);
    #else  // use default BAUDRATE if TMC_BAUD_RATE not defined
      Serial2.begin(BAUDRATE, SERIAL_8N1, HARDWARE_SERIAL2_RX, HARDWARE_SERIAL2_TX);
    #endif
  #endif

  // Initialize the i2s peripheral only if the I2S stepper stream is enabled.
  // The following initialization is performed after Serial1 and Serial2 are defined as
  // their native pins might conflict with the i2s stream even when they are remapped.
  #if ENABLED(USE_ESP32_EXIO)
    YSerial2.begin(460800 * 3, SERIAL_8N1, 16, 17);
  #elif ENABLED(I2S_STEPPER_STREAM)
    i2s_init();
  #endif
}

volatile int16_t adcCache[4] = {26000, 26000, 26000, 26000};
volatile bool needsConversion[4] = {0, 0, 0, 0};

 // All displays share the MarlinUI class
 #include "..\..\lcd\marlinui.h"
 extern MarlinUI ui;
 

long lastLoadCellLoop = 0;
long lastPCFSync = 0;
void MarlinHAL::idletask() {
  //SERIAL_IMPL.println("update_buttons Idle()");
  //ui.update_buttons();
  if (millis() - lastLoadCellLoop > 13) {// < 80hz
    lastLoadCellLoop = millis();
    LoadCellLoop();
  }
  if (millis() - lastPCFSync >= 1) {// at most 1khz
    lastPCFSync = millis();
    if (xSemaphoreTake(xPCFIOMutex, 0)) {
      pcf1_write_pending = true;
      pcf2_write_pending = true; // this is to refresh PCF in case it has reset due to a brown out.
      PCFSync();
      xSemaphoreGive(xPCFIOMutex);
    }
  }
  UILoop();
  #if BOTH(WIFISUPPORT, OTASUPPORT)
    OTA_handle();
  #endif
  TERN_(ESP3D_WIFISUPPORT, esp3dlib.idletask());

  #if ENABLED(M3DPrintVueSupport)
    M3DPrintVueLoop();
  #endif
  // for (int i = 0; i < 4; i++){
  //   if (needsConversion[i]){
  //     int16_t newVal = ads.readADC_SingleEnded(i) * 0.03875;
  //     if (abs(newVal - adcCache[i]) > 50){
  //       adcCache[i] = ((long)(newVal * 5 + adcCache[i] * 95)) / 100;  
  //     }
  //     else{
  //       adcCache[i] = newVal;
  //       needsConversion[i] = false;
  //     }
  //     //SERIAL_IMPL.println(adcCache[i]);
  //   }
  // }
  
  ui.update_buttons();
  
}

uint8_t MarlinHAL::get_reset_source() { return rtc_get_reset_reason(1); }

void MarlinHAL::reboot() { ESP.restart(); }

void _delay_ms(int delay_ms) { delay(delay_ms); }

// return free memory between end of heap (or end bss) and whatever is current
int MarlinHAL::freeMemory() { return ESP.getFreeHeap(); }

// ------------------------
// Watchdog Timer
// ------------------------
#if ENABLED(USE_WATCHDOG)

  #define WDT_TIMEOUT_US TERN(WATCHDOG_DURATION_8S, 8000000, 4000000) // 4 or 8 second timeout

  extern "C" {
    bool heaterPinsEnabled = true;
    void disableHeaterPins(){
      heaterPinsEnabled = false;
      delay(1); // confirms we are outside pcf writes that takes 200us
    }
    void enableHeaterPins(){
      heaterPinsEnabled = true;
    }
    esp_err_t esp_task_wdt_reset();
  
    // Declare original weak functions from the ESP32 core
    extern void __digitalWrite(uint8_t pin, uint8_t val);
    extern int  __digitalRead(uint8_t pin);
    //extern uint16_t __analogRead(uint8_t pin);
  // Override digitalWrite
  void digitalWrite(uint8_t pin, uint8_t val) {
  if (pin >= 200 && pin < 216) {
    uint8_t bit = pin - 200;

    if (((pcfWriteMapConfirmed >> bit) & 1) == val) return; // already up to date

    if (val) {
      pcfMapToSync |= (1 << bit);
    }
    else {
      pcfMapToSync &= ~(1 << bit);
    }
    if (bit < 8)
      pcf1_write_pending = true;
    else
      pcf2_write_pending = true;

    if (PCFIsBusy){ // PCF is busy. We need to see if this is a high priority request
      // we can let it go through only if we have a lock on the bits
      if ((1 << bit) & lockedBits){        
        PCFSync(true);
      }
      // can't sync in any way
      // We have already set the flags, priority user will sync when the lock is released
      return;
    }
    if (pin == Z_DIR_PIN) {// 2nd highest priority by default
      if (PCFSync()) // Done! Return
        return;
      else { // Give it one more try. Most probably will fail too. Its a soft failure, not a hard one.
        if (PCFSync())
          return;
        //else
          // At least let us queue it up.
      }
    }
    if (xPortInIsrContext()) {
      // We can trigger a sync in the io task
      if (pcfTaskHandle != NULL) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        vTaskNotifyGiveFromISR(pcfTaskHandle, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
      }
      return;
    }

    // Not in ISR, not busy, sync now
    if (xSemaphoreTake(xPCFIOMutex, portMAX_DELAY)) {
     PCFSync();
      xSemaphoreGive(xPCFIOMutex);
    }
    // This is double write. Can only happen in task from another core.
    return;
  }
  else if (pin == 217){ // Probe enable disable
    ProbeEnable = val;
  }
  else
    __digitalWrite(pin, val);
}

    
